In [11]:
import pandas as pd
import numpy as np
import matplotlib as pyplot
ipl_data={'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df=pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [12]:
df.groupby('Team')

In [13]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [18]:
df.groupby(['Team','Rank']).groups

{('Devils', 2): Int64Index([2], dtype='int64'),
 ('Devils', 3): Int64Index([3], dtype='int64'),
 ('Kings', 1): Int64Index([6, 7], dtype='int64'),
 ('Kings', 3): Int64Index([4], dtype='int64'),
 ('Riders', 1): Int64Index([0], dtype='int64'),
 ('Riders', 2): Int64Index([1, 8, 11], dtype='int64'),
 ('Royals', 1): Int64Index([10], dtype='int64'),
 ('Royals', 4): Int64Index([9], dtype='int64'),
 ('kings', 4): Int64Index([5], dtype='int64')}

In [19]:
df.groupby('Year').groups

{2014: Int64Index([0, 2, 4, 9], dtype='int64'),
 2015: Int64Index([1, 3, 5, 10], dtype='int64'),
 2016: Int64Index([6, 8], dtype='int64'),
 2017: Int64Index([7, 11], dtype='int64')}

In [27]:
grouped=df.groupby('Year')
for name, group in grouped:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [30]:
grouped=df.groupby('Year')
grouped.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [33]:
grouped=df.groupby('Year')
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [36]:
grouped=df.groupby('Year')
grouped['Points'].agg([np.sum,np.mean,np.std,np.median])

       sum    mean        std  median
Year
2014  3181  795.25  87.439026   802.0
2015  3078  769.50  65.035888   796.5
2016  1450  725.00  43.840620   725.0
2017  1478  739.00  69.296465   739.0